---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightTable.Clear
source: html/da252adf-d887-4748-dafd-55d8e5aa0436.htm
---
# Autodesk.Revit.DB.ExportLineweightTable.Clear Method

Removes all contents stored in Export line weight table.

## Syntax (C#)
```csharp
public void Clear()
```